Revit 2024 API
Transaction Properties
The Transaction type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
Transaction Class
Autodesk.Revit.DB Namespace